[
    {
        "id": "msg1",
        "source": "Email",
        "from": "AlArqam Islamic School & College <adminoffice@arqamschool.org>",
        "subject": "Coffee with the Principal Apr 24 @ 8",
        "sent_at": "2025-04-08T12:35:03-07:00",
        "body": "Asalem alaikum Parents, InshaAllah, this message reaches you in a state of good health and strong iman. InshaAllah, we would like to return to having \"Coffee with the Principal\" Two sessions remain for this school year: Thursday, April 24th from 8:00 am - 9:00am. Thursday, May 15th from 8:00am - 9:00am. Please come to engage in a positive conversation about our school. Hot beverages and snacks will be available and you are welcome to bring your own beverage. Please park in front of the building and enter door 15 and take the stairs or elevator to the second floor. Please follow signs to the exact location (TBA) for the \"Coffee with the Principal\". We look forward to seeing you there! Baraka Allahu fikum. Admin. Team Al-Arqam Islamic School & College Preparatory 6990 65th Street Sacramento, CA  95823 916-391-3333"
      },
    {
        "id": "msg2",
        "source": "Email",
        "from": "AlArqam Islamic School & College <adminoffice@arqamschool.org>",
        "subject": "Quran Competition Award Ceremony - Save the Date",
        "sent_at": "2025-04-09T12:01:01-07:00",
        "body": "Assalamu Alaikum Wa Rahmatullahi Wa Barakatuh, Respected Parents and Esteemed Faculty, Insha’Allah, this message reaches you in the best of health and Imaan. Alhamdulillah, by the mercy of Allah (SWT), our Quran Department, in collaboration with Al-Arqam Islamic School and College Preparatory, successfully hosted the annual Quran Competition in person. It was a heartwarming experience to witness our students recite their selected ayat with passion, care, and proper tajweed in front of our esteemed panel of judges. We are delighted to invite our parents and faculty to join us in celebrating our students’ dedication and achievements during this blessed event. Insha’Allah, the Quran Competition Award Ceremony will take place as follows: 📍 Location: School Auditorium 📅 Date: Friday, April 18, 2025 Elementary Students: KG–2nd Grade: 8:00 AM – 8:30 AM 3rd–5th Grade: 8:30 AM – 9:00 AM Secondary Students: 6th–12th Grade: 9:45 AM – 10:25 AM We would like to extend our heartfelt gratitude to our dedicated Quran teachers for their tireless efforts and support throughout this journey. Special thanks and appreciation go to: Sh. Mohammad Kamel, Sh. Waheed Ahmadzada, Sr. Sara Farrah, Br. Ahdil Khan, Sr. Zahra Slubi, and Sr. Shahla Omer for their unwavering commitment to nurturing a love for the Quran in our students, masha’Allah. We are also sincerely thankful to our Parent-Teacher Organization (PTO) for their continuous support in making school-wide initiatives, like the Quran Contest, a true success. A special note of appreciation goes to our community members who graciously volunteered their time to serve as judges. Your dedication to our students and school is deeply valued. Jazakum Allahu Khairan for your support. We look forward to welcoming you all to this joyful and spiritually uplifting celebration, insha’Allah. Warm regards, Quran Department and Admin Team"
    }    
  ]
  


